In [31]:
import numpy as np
import pandas as pd

In [32]:
data = {'Yil':[2021, 2020, 2019, 2018, 2017, 2016, 2015, 2010],
       'Aholi soni':[33.9, 33.5, 32.9, 32.5, 31.9, 31.4, 30.9, 28.5],
       'Temp':[1.54, 1.48, 1.56, 1.62, 1.65, 1.66, 1.64, 1.53],
       'Zichlik':[79.77, 78.68, 77.53, 76.34, 75.13, 73.91, 72.71, 67.03]}

In [33]:
df = pd.DataFrame(data)

In [34]:
df

    Yil  Aholi soni  Temp  Zichlik
0  2021        33.9  1.54    79.77
1  2020        33.5  1.48    78.68
2  2019        32.9  1.56    77.53
3  2018        32.5  1.62    76.34
4  2017        31.9  1.65    75.13
5  2016        31.4  1.66    73.91
6  2015        30.9  1.64    72.71
7  2010        28.5  1.53    67.03

In [35]:
df.index = range(1,9)

In [36]:
df

    Yil  Aholi soni  Temp  Zichlik
1  2021        33.9  1.54    79.77
2  2020        33.5  1.48    78.68
3  2019        32.9  1.56    77.53
4  2018        32.5  1.62    76.34
5  2017        31.9  1.65    75.13
6  2016        31.4  1.66    73.91
7  2015        30.9  1.64    72.71
8  2010        28.5  1.53    67.03

In [37]:
df = df[['Yil', 'Aholi soni', 'Temp', 'Zichlik']]

In [38]:
df

    Yil  Aholi soni  Temp  Zichlik
1  2021        33.9  1.54    79.77
2  2020        33.5  1.48    78.68
3  2019        32.9  1.56    77.53
4  2018        32.5  1.62    76.34
5  2017        31.9  1.65    75.13
6  2016        31.4  1.66    73.91
7  2015        30.9  1.64    72.71
8  2010        28.5  1.53    67.03

In [44]:
# .reindex()

df.reindex([3,4,6])

    Yil  Aholi soni  Temp  Zichlik
3  2019        32.9  1.56    77.53
4  2018        32.5  1.62    76.34
6  2016        31.4  1.66    73.91

In [54]:
df1=df.reindex(columns=['Aholi soni', 'Zichlik'])
df1

   Aholi soni  Zichlik
1        33.9    79.77
2        33.5    78.68
3        32.9    77.53
4        32.5    76.34
5        31.9    75.13
6        31.4    73.91
7        30.9    72.71
8        28.5    67.03

In [58]:
df1.iloc[0:4]

   Aholi soni  Zichlik
1        33.9    79.77
2        33.5    78.68
3        32.9    77.53
4        32.5    76.34

In [66]:
df1['Zichlik']

1    79.77
2    78.68
3    77.53
4    76.34
5    75.13
6    73.91
7    72.71
8    67.03
Name: Zichlik, dtype: float64

In [73]:
df1.loc[[2,3,4,5,6,7],['Zichlik']]

   Zichlik
2    78.68
3    77.53
4    76.34
5    75.13
6    73.91
7    72.71

In [96]:
df.iloc[0:5,2:3]

   Temp
1  1.54
2  1.48
3  1.56
4  1.62
5  1.65

In [97]:
df

    Yil  Aholi soni  Temp  Zichlik
1  2021        33.9  1.54    79.77
2  2020        33.5  1.48    78.68
3  2019        32.9  1.56    77.53
4  2018        32.5  1.62    76.34
5  2017        31.9  1.65    75.13
6  2016        31.4  1.66    73.91
7  2015        30.9  1.64    72.71
8  2010        28.5  1.53    67.03

In [98]:
df.loc[[5,8],['Yil','Zichlik']]

    Yil  Zichlik
5  2017    75.13
8  2010    67.03

In [107]:
df.loc[3:7,'Zichlik']

3    77.53
4    76.34
5    75.13
6    73.91
7    72.71
Name: Zichlik, dtype: float64

In [108]:
nums = list(range(0,11))

nums

In [109]:
nums

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [111]:
ser = pd.Series(np.arange(10,21))
ser

0     10
1     11
2     12
3     13
4     14
5     15
6     16
7     17
8     18
9     19
10    20
dtype: int32

In [112]:
nums[-1]

10

In [113]:
ser.iloc[-1]

20